<h2> Objective:- Task 5D: Working with pandas Data Frames Part 2 </h2>

<div style="text-align: right"> Done by: <b>Karan Murjani </b> </div>

### Intro : The standard Python library pandas is one of the most popular libraries used for data analysis and manipulation. Pandas is used to convert data into a structured format known as a DataFrame that can be used for a wide variety of operations and analytics. All the manipulation with data is done using pandas functions. This task was done using all the pandas function available.

In [1]:
#Dependency
import pandas as pd
import numpy as np
import warnings
import matplotlib.pyplot as plt 
from datetime import timedelta 
import sqlite3
import tempfile
import os.path
warnings.filterwarnings('ignore')

### 1. Establish a connection with a new SQLite database on your disk.

In [2]:
#Reading files
nyc_airlines_df = pd.read_csv('nycflights13_airlines.csv')
nyc_airport_df = pd.read_csv('nycflights13_airports.csv')
nyc_flights_df = pd.read_csv('nycflights13_flights.csv')
nyc_planes_df = pd.read_csv('nycflights13_planes.csv')
nyc_weather_df = pd.read_csv('nycflights13_weather.csv')

In [3]:
#Establish connection
dbfile = os.path.join(tempfile.mkdtemp(), "nycflights.db") 
print(dbfile)

#Establishing the connection to the database
conn = sqlite3.connect(dbfile)

/var/folders/nr/ksh5z2r56031_6w99r5fbgmm0000gn/T/tmp31ya62ej/nycflights.db

### 2. Export all the CSV files to the said database.

In [4]:
nyc_airlines_df.to_sql("Airline", conn, index = False)
nyc_airport_df.to_sql("Airport", conn, index = False)
nyc_planes_df.to_sql("Planes", conn, index = False)
nyc_weather_df.to_sql("Weather", conn, index = False)
nyc_flights_df.to_sql("Flights", conn, index = False)

In [5]:
nyc_planes_df.head()

,tailnum,year,type,manufacturer,model,engines,seats,speed,engine
0,N10156,2004.0,Fixed wing multi engine,EMBRAER,EMB-145XR,2,55,NaN,Turbo-fan
1,N102UW,1998.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
2,N103US,1999.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
3,N104UW,1999.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
4,N10575,2002.0,Fixed wing multi engine,EMBRAER,EMB-145LR,2,55,NaN,Turbo-fan

### 3. For each of the SQL queries below (each query in a separate section), write the code that yields equivalent results using pandas only and explain – in your own words – what it does

###### Query 1:

In [6]:
#Query
task1_sql = pd.read_sql_query(""" 
    SELECT DISTINCT engine FROM planes
""", conn) 

#Pandas filter
task1_my = nyc_planes_df['engine'].unique()

#Result print
print('Result from SQL Query:')
print(task1_sql)
print('\nResult from Pandas:')
print(task1_my)

Result from SQL Query:
          engine
0      Turbo-fan
1      Turbo-jet
2  Reciprocating
3        4 Cycle
4    Turbo-shaft
5     Turbo-prop

Result from Pandas:
['Turbo-fan' 'Turbo-jet' 'Reciprocating' '4 Cycle' 'Turbo-shaft'
 'Turbo-prop']

##### Here for pandas implementation I have used unique function from pandas which gives me all the unique values from engine column just like Distinct in SQL

###### Query 2:

In [7]:
#Query
task2_sql = pd.read_sql_query(""" 
    SELECT DISTINCT type, engine FROM planes
""", conn) 

#Pandas filter
task2_my = pd.DataFrame(data = nyc_planes_df[['type', 'engine']].drop_duplicates().
                        reset_index(), columns=['type', 'engine'])

#Result print
print('Result from SQL Query:')
print(task2_sql)
print('\nResult from Pandas:')
print(task2_my)

Result from SQL Query:
                       type         engine
0   Fixed wing multi engine      Turbo-fan
1   Fixed wing multi engine      Turbo-jet
2  Fixed wing single engine  Reciprocating
3   Fixed wing multi engine  Reciprocating
4  Fixed wing single engine        4 Cycle
5                Rotorcraft    Turbo-shaft
6   Fixed wing multi engine     Turbo-prop

Result from Pandas:
                       type         engine
0   Fixed wing multi engine      Turbo-fan
1   Fixed wing multi engine      Turbo-jet
2  Fixed wing single engine  Reciprocating
3   Fixed wing multi engine  Reciprocating
4  Fixed wing single engine        4 Cycle
5                Rotorcraft    Turbo-shaft
6   Fixed wing multi engine     Turbo-prop

##### Here for pandas implementation I have created new dataframe and inserted the columns required and used drop_duplicates function for keeping unique values from type and engine just like Distinct in SQL

###### Query 3:

In [8]:
#Query
task3_sql = pd.read_sql_query(""" 
    SELECT COUNT(*), engine FROM planes GROUP BY engine
""", conn) 

#Pandas filter
task3_my = nyc_planes_df.groupby(['engine']).size().reset_index(name='Count(*)')

#Result print
print('Result from SQL Query:')
print(task3_sql.head(5))
print('\nResult from Pandas:')
print(task3_my.head(5))

Result from SQL Query:
   COUNT(*)         engine
0         2        4 Cycle
1        28  Reciprocating
2      2750      Turbo-fan
3       535      Turbo-jet
4         2     Turbo-prop

Result from Pandas:
          engine  Count(*)
0        4 Cycle         2
1  Reciprocating        28
2      Turbo-fan      2750
3      Turbo-jet       535
4     Turbo-prop         2

##### Here for pandas implementation I have used groupby function from pandas and aggregate function is just count and later renamed the column.

###### Query 4:

In [9]:
#Query
task4_sql = pd.read_sql_query(""" 
    SELECT COUNT(*), engine, type FROM planes GROUP BY engine, type
""", conn) 

#Pandas filter
task4_my=(nyc_planes_df.groupby(['engine', 'type']).size().
          reset_index(name='Count(*)'))

#Result print
print('Result from SQL Query:')
print(task4_sql.head(5))
print('\nResult from Pandas:')
print(task4_my.head(5))

Result from SQL Query:
   COUNT(*)         engine                      type
0         2        4 Cycle  Fixed wing single engine
1         5  Reciprocating   Fixed wing multi engine
2        23  Reciprocating  Fixed wing single engine
3      2750      Turbo-fan   Fixed wing multi engine
4       535      Turbo-jet   Fixed wing multi engine

Result from Pandas:
          engine                      type  Count(*)
0        4 Cycle  Fixed wing single engine         2
1  Reciprocating   Fixed wing multi engine         5
2  Reciprocating  Fixed wing single engine        23
3      Turbo-fan   Fixed wing multi engine      2750
4      Turbo-jet   Fixed wing multi engine       535

##### Here for pandas implementation I have used groupby function from pandas but groupby on more than one column i.e. engine and type and aggregate function is just count and later renamed the column.

###### Query 5:

In [10]:
#Query
task5_sql = pd.read_sql_query(""" 
    SELECT MIN(year), AVG(year), MAX(year), engine, manufacturer 
    FROM planes 
    GROUP BY engine, manufacturer
""", conn) 

#Pandas filter
task5_my = (nyc_planes_df.groupby(['engine', 'manufacturer'])['year'].
            aggregate(["min", "mean", "max"]).reset_index())
task5_my = task5_my.rename(columns={'min':'MIN(year)', 'mean':'AVG(year)', 
                                    'max':'MAX(year)'})
task5_my = task5_my.reindex(["MIN(year)", "AVG(year)", "MAX(year)", 
                             "engine", "manufacturer"], axis=1)

#Result print
print('Result from SQL Query:')
print(task5_sql.head(5))
print('\nResult from Pandas:')
print(task5_my.head(5))

Result from SQL Query:
   MIN(year)  AVG(year)  MAX(year)         engine           manufacturer
0     1975.0     1975.0     1975.0        4 Cycle                 CESSNA
1        NaN        NaN        NaN        4 Cycle            JOHN G HESS
2        NaN        NaN        NaN  Reciprocating  AMERICAN AIRCRAFT INC
3     2007.0     2007.0     2007.0  Reciprocating     AVIAT AIRCRAFT INC
4        NaN        NaN        NaN  Reciprocating          BARKER JACK L

Result from Pandas:
   MIN(year)  AVG(year)  MAX(year)         engine           manufacturer
0     1975.0     1975.0     1975.0        4 Cycle                 CESSNA
1        NaN        NaN        NaN        4 Cycle            JOHN G HESS
2        NaN        NaN        NaN  Reciprocating  AMERICAN AIRCRAFT INC
3     2007.0     2007.0     2007.0  Reciprocating     AVIAT AIRCRAFT INC
4        NaN        NaN        NaN  Reciprocating          BARKER JACK L

##### Here for pandas implementation I have used groupby function from pandas on engine and manufacturer and aggregate function min, mean, max for year values and later renamed the column and reindexing

###### Query 6:

In [11]:
#Query
task6_sql = pd.read_sql_query(""" 
    SELECT * FROM planes WHERE speed IS NOT NULL
""", conn) 

#Pandas filter
task6_my = nyc_planes_df.query('speed==speed')

#Result print
print('Result from SQL Query:')
print(task6_sql.head(5))
print('\nResult from Pandas:')
print(task6_sql.head(5))

Result from SQL Query:
  tailnum    year                      type manufacturer      model  engines  \
0  N201AA  1959.0  Fixed wing single engine       CESSNA        150        1
1  N202AA  1980.0   Fixed wing multi engine       CESSNA       421C        2
2  N350AA  1980.0   Fixed wing multi engine        PIPER  PA-31-350        2
3  N364AA  1973.0   Fixed wing multi engine       CESSNA       310Q        2
4  N378AA  1963.0  Fixed wing single engine       CESSNA       172E        1

   seats  speed         engine
0      2   90.0  Reciprocating
1      8   90.0  Reciprocating
2      8  162.0  Reciprocating
3      6  167.0  Reciprocating
4      4  105.0  Reciprocating

Result from Pandas:
  tailnum    year                      type manufacturer      model  engines  \
0  N201AA  1959.0  Fixed wing single engine       CESSNA        150        1
1  N202AA  1980.0   Fixed wing multi engine       CESSNA       421C        2
2  N350AA  1980.0   Fixed wing multi engine        PIPER  PA-31-350        2
3  N364AA  1973.0   Fixed wing multi engine       CESSNA       310Q        2
4  N378AA  1963.0  Fixed wing single engine       CESSNA       172E        1

   seats  speed         engine
0      2   90.0  Reciprocating
1      8   90.0  Reciprocating
2      8  162.0  Reciprocating
3      6  167.0  Reciprocating
4      4  105.0  Reciprocating

##### Here for pandas implementation I have filtered all the rows where there is no null values by .query function.

###### Query 7:

In [12]:
task7_sql = pd.read_sql_query("""
    SELECT tailnum FROM planes
    WHERE seats BETWEEN 150 AND 190 AND year >= 2012
""", conn)

task7_my = (nyc_planes_df.query('(year >= 2012) and ((seats>=150) and (seats<=190))')
            ['tailnum']).reset_index(drop=True)

#Result print
print('Result from SQL Query:')
print(task7_sql.head(5))
print('\nResult from Pandas:')
print(task7_my.head(5))

Result from SQL Query:
  tailnum
0  N361VA
1  N849VA
2  N851VA
3  N852VA
4  N853VA

Result from Pandas:
0    N361VA
1    N849VA
2    N851VA
3    N852VA
4    N853VA
Name: tailnum, dtype: object

##### Here for pandas implementation I have filtered all the rows where as asked in the question by .query function.

###### Query 8:

In [13]:
task8_sql = pd.read_sql_query("""
    SELECT tailnum, manufacturer, seats FROM planes
    WHERE manufacturer IN ("BOEING", "AIRBUS", "EMBRAER") AND seats>390
""", conn)

filter = ["BOEING", "AIRBUS", "EMBRAER"]
task8_my = (nyc_planes_df.query('(manufacturer==@filter) and (seats>390)')
            [['tailnum', 'manufacturer', 'seats']])

#Result print
print('Result from SQL Query:')
print(task8_sql.head(5))
print('\nResult from Pandas:')
print(task8_my.head(5))

Result from SQL Query:
  tailnum manufacturer  seats
0  N206UA       BOEING    400
1  N228UA       BOEING    400
2  N272AT       BOEING    400
3  N57016       BOEING    400
4  N670US       BOEING    450

Result from Pandas:
     tailnum manufacturer  seats
439   N206UA       BOEING    400
484   N228UA       BOEING    400
577   N272AT       BOEING    400
1708  N57016       BOEING    400
2109  N670US       BOEING    450

##### Here for pandas implementation I have filtered all the rows where as asked in the question by .query function.

###### Query 9:

In [14]:
task9_sql = pd.read_sql_query("""
    SELECT DISTINCT year, seats FROM planes
    WHERE year >= 2012 ORDER BY year ASC, seats DESC
""", conn)

task9_my = (nyc_planes_df.query('year>=2012')[['year', 'seats']].drop_duplicates().
            sort_values(["year", "seats"], ascending = [True, False]).
            reset_index(drop=True))

#Result print
print('Result from SQL Query:')
print(task9_sql.head(5))
print('\nResult from Pandas:')
print(task9_my.head(5))

Result from SQL Query:
     year  seats
0  2012.0    379
1  2012.0    377
2  2012.0    260
3  2012.0    222
4  2012.0    200

Result from Pandas:
     year  seats
0  2012.0    379
1  2012.0    377
2  2012.0    260
3  2012.0    222
4  2012.0    200

##### Here for pandas implementation I have filtered all the rows where as asked in the question by .query function. Later on I have dropped duplicate values, sorted values as asked in the question by resetting the index at the end.

###### Query 10:

In [15]:
task10_sql = pd.read_sql_query("""
    SELECT DISTINCT year, seats FROM planes
    WHERE year >= 2012 ORDER BY seats DESC, year ASC
""", conn)

task10_my = (nyc_planes_df.query('year>=2012')[['year', 'seats']].drop_duplicates().
            sort_values(["seats", "year"], ascending = [False, True]).
             reset_index(drop=True))

#Result print
print('Result from SQL Query:')
print(task10_sql.head(5))
print('\nResult from Pandas:')
print(task10_my.head(5))

Result from SQL Query:
     year  seats
0  2012.0    379
1  2013.0    379
2  2012.0    377
3  2013.0    377
4  2012.0    260

Result from Pandas:
     year  seats
0  2012.0    379
1  2013.0    379
2  2012.0    377
3  2013.0    377
4  2012.0    260

##### This is pretty similar to previous question, just the sorting is changed as asked.

###### Query 11:

In [16]:
task11_sql = pd.read_sql_query("""
    SELECT manufacturer, COUNT(*) 
    FROM planes WHERE seats > 200 GROUP BY manufacturer
""", conn)

task11_my = (nyc_planes_df.query('seats>200').groupby('manufacturer').size().
             reset_index().rename(columns = {0:"COUNT(*)"}))

#Result print
print('Result from SQL Query:')
print(task11_sql.head(5))
print('\nResult from Pandas:')
print(task11_my.head(5))

Result from SQL Query:
       manufacturer  COUNT(*)
0            AIRBUS        66
1  AIRBUS INDUSTRIE         4
2            BOEING       225

Result from Pandas:
       manufacturer  COUNT(*)
0            AIRBUS        66
1  AIRBUS INDUSTRIE         4
2            BOEING       225

##### Here for pandas implementation I have filtered the data with seats more than 200 and then used groupby function on manufacturer for counting how many rows.

###### Query 12:

In [17]:
task12_sql = pd.read_sql_query("""
    SELECT manufacturer, COUNT(*)
    FROM planes GROUP BY manufacturer HAVING COUNT(*) > 10
""", conn)

task12_my = (nyc_planes_df.groupby('manufacturer').size().reset_index().
             rename(columns = {0:"COUNT(*)"}))

task12_my = task12_my.query('`COUNT(*)`>10').reset_index(drop=True)

#Result print
print('Result from SQL Query:')
print(task12_sql.head(5))
print('\nResult from Pandas:')
print(task12_my.head(5))

Result from SQL Query:
       manufacturer  COUNT(*)
0            AIRBUS       336
1  AIRBUS INDUSTRIE       400
2            BOEING      1630
3    BOMBARDIER INC       368
4           EMBRAER       299

Result from Pandas:
       manufacturer  COUNT(*)
0            AIRBUS       336
1  AIRBUS INDUSTRIE       400
2            BOEING      1630
3    BOMBARDIER INC       368
4           EMBRAER       299

##### Here for pandas implementation used groupby function on manufacturer for counting how many rows.

In [18]:
pd.testing.assert_frame_equal(task12_sql, task12_my)

###### Query 13:

In [19]:
task13_sql = pd.read_sql_query("""
    SELECT manufacturer, COUNT(*) FROM planes
    WHERE seats > 200 GROUP BY manufacturer HAVING COUNT(*) > 10
""", conn)

task13_my = (nyc_planes_df.query("seats>200").groupby('manufacturer').size().
             reset_index().rename(columns = {0:"COUNT(*)"}))
task13_my = task13_my.query('`COUNT(*)`>10').reset_index(drop=True)

#Result print
print('Result from SQL Query:')
print(task13_sql.head(5))
print('\nResult from Pandas:')
print(task13_my.head(5))

Result from SQL Query:
  manufacturer  COUNT(*)
0       AIRBUS        66
1       BOEING       225

Result from Pandas:
  manufacturer  COUNT(*)
0       AIRBUS        66
1       BOEING       225

##### Here for pandas implementation I have filtered the data with seats more than 200 and then used groupby function on manufacturer for counting how many rows. Later on, I have filtered the records which has count(*) more than 10.

In [20]:
pd.testing.assert_frame_equal(task13_sql, task13_my)

###### Query 14:

In [21]:
task14_sql = pd.read_sql_query("""
   SELECT manufacturer, COUNT(*) AS howmany
    FROM planes
    GROUP BY manufacturer
    ORDER BY howmany DESC LIMIT 5
""", conn)

task14_my = (nyc_planes_df.groupby('manufacturer').size().reset_index().
             rename(columns = {0:"howmany"}))
task14_my = (task14_my.sort_values("howmany", ascending=False).head(5).
             reset_index(drop=True))

#Result print
print('Result from SQL Query:')
print(task14_sql.head(5))
print('\nResult from Pandas:')
print(task14_my.head(5))

Result from SQL Query:
       manufacturer  howmany
0            BOEING     1630
1  AIRBUS INDUSTRIE      400
2    BOMBARDIER INC      368
3            AIRBUS      336
4           EMBRAER      299

Result from Pandas:
       manufacturer  howmany
0            BOEING     1630
1  AIRBUS INDUSTRIE      400
2    BOMBARDIER INC      368
3            AIRBUS      336
4           EMBRAER      299

##### Here for pandas implementation I have used groupby function on manufacturer for counting how many rows and then sorted the values by descending order.

In [22]:
pd.testing.assert_frame_equal(task14_sql, task14_my)

###### Query 15:

In [23]:
task15_sql = pd.read_sql_query("""
    SELECT
    flights.*,
    planes.year AS plane_year,
    planes.speed AS plane_speed,
    planes.seats AS plane_seats
    FROM flights LEFT JOIN planes ON flights.tailnum=planes.tailnum
""", conn)
task15_my = pd.merge(nyc_flights_df,
                  nyc_planes_df[['tailnum', 'year', 'speed', 'seats']],
                  on = 'tailnum', how = 'left')
task15_my.rename(columns = {'year_x' : 'year', 'year_y' : 'plane_year', 'speed' : 
                            'plane_speed','seats' : 'plane_seats'}, inplace = True)

#Result print
print('Result from SQL Query:')
print(task15_sql.head(5))
print('\nResult from Pandas:')
print(task15_my.head(5))

Result from SQL Query:
   year  month  day  dep_time  sched_dep_time  dep_delay  arr_time  \
0  2013      1    1     517.0             515        2.0     830.0
1  2013      1    1     533.0             529        4.0     850.0
2  2013      1    1     542.0             540        2.0     923.0
3  2013      1    1     544.0             545       -1.0    1004.0
4  2013      1    1     554.0             600       -6.0     812.0

   sched_arr_time  arr_delay carrier  ...  origin dest air_time distance  \
0             819       11.0      UA  ...     EWR  IAH    227.0     1400
1             830       20.0      UA  ...     LGA  IAH    227.0     1416
2             850       33.0      AA  ...     JFK  MIA    160.0     1089
3            1022      -18.0      B6  ...     JFK  BQN    183.0     1576
4             837      -25.0      DL  ...     LGA  ATL    116.0      762

   hour  minute      time_hour  plane_year plane_speed  plane_seats
0     5      15  01/01/13 5:00      1999.0         NaN        149.0
1     5      29  01/01/13 5:00      1998.0         NaN        149.0
2     5      40  01/01/13 5:00      1990.0         NaN        178.0
3     5      45  01/01/13 5:00      2012.0         NaN        200.0
4     6       0  01/01/13 6:00      1991.0         NaN        178.0

[5 rows x 22 columns]

Result from Pandas:
   year  month  day  dep_time  sched_dep_time  dep_delay  arr_time  \
0  2013      1    1     517.0             515        2.0     830.0
1  2013      1    1     533.0             529        4.0     850.0
2  2013      1    1     542.0             540        2.0     923.0
3  2013      1    1     544.0             545       -1.0    1004.0
4  2013      1    1     554.0             600       -6.0     812.0

   sched_arr_time  arr_delay carrier  ...  origin dest air_time distance  \
0             819       11.0      UA  ...     EWR  IAH    227.0     1400
1             830       20.0      UA  ...     LGA  IAH    227.0     1416
2             850       33.0      AA  ...     JFK  MIA    160.0     1089
3            1022      -18.0      B6  ...     JFK  BQN    183.0     1576
4             837      -25.0      DL  ...     LGA  ATL    116.0      762

   hour  minute      time_hour  plane_year plane_speed  plane_seats
0     5      15  01/01/13 5:00      1999.0         NaN        149.0
1     5      29  01/01/13 5:00      1998.0         NaN        149.0
2     5      40  01/01/13 5:00      1990.0         NaN        178.0
3     5      45  01/01/13 5:00      2012.0         NaN        200.0
4     6       0  01/01/13 6:00      1991.0         NaN        178.0

[5 rows x 22 columns]

In [24]:
pd.testing.assert_frame_equal(task15_sql, task15_my)

##### Here for pandas implementation I have used merge function from pandas for merging columns from two different table.

###### Query 16:

In [25]:
#Query df
task16_sql = pd.read_sql_query("""
    SELECT planes.*, airline.* FROM
    (SELECT DISTINCT carrier, tailnum FROM flights) AS cartail
    INNER JOIN planes ON cartail.tailnum=planes.tailnum
    INNER JOIN airline ON cartail.carrier=airline.carrier
""", conn)

#Pandas df
cartail_df = (nyc_flights_df[['carrier', 'tailnum']].
              drop_duplicates().reset_index(drop=True))
task16_my = pd.merge(nyc_airlines_df, cartail_df, on ='carrier', how='inner')
task16_my = pd.merge(nyc_planes_df, task16_my, on = "tailnum", how='inner')

#Result print
print('Result from SQL Query:')
print(task16_sql.head(5))
print('\nResult from Pandas:')
print(task16_my.head(5))

Result from SQL Query:
  tailnum    year                     type      manufacturer      model  \
0  N10156  2004.0  Fixed wing multi engine           EMBRAER  EMB-145XR
1  N102UW  1998.0  Fixed wing multi engine  AIRBUS INDUSTRIE   A320-214
2  N103US  1999.0  Fixed wing multi engine  AIRBUS INDUSTRIE   A320-214
3  N104UW  1999.0  Fixed wing multi engine  AIRBUS INDUSTRIE   A320-214
4  N10575  2002.0  Fixed wing multi engine           EMBRAER  EMB-145LR

   engines  seats  speed     engine carrier                      name
0        2     55    NaN  Turbo-fan      EV  ExpressJet Airlines Inc.
1        2    182    NaN  Turbo-fan      US           US Airways Inc.
2        2    182    NaN  Turbo-fan      US           US Airways Inc.
3        2    182    NaN  Turbo-fan      US           US Airways Inc.
4        2     55    NaN  Turbo-fan      EV  ExpressJet Airlines Inc.

Result from Pandas:
  tailnum    year                     type      manufacturer      model  \
0  N10156  2004.0  Fixed wing multi engine           EMBRAER  EMB-145XR
1  N102UW  1998.0  Fixed wing multi engine  AIRBUS INDUSTRIE   A320-214
2  N103US  1999.0  Fixed wing multi engine  AIRBUS INDUSTRIE   A320-214
3  N104UW  1999.0  Fixed wing multi engine  AIRBUS INDUSTRIE   A320-214
4  N10575  2002.0  Fixed wing multi engine           EMBRAER  EMB-145LR

   engines  seats  speed     engine carrier                      name
0        2     55    NaN  Turbo-fan      EV  ExpressJet Airlines Inc.
1        2    182    NaN  Turbo-fan      US           US Airways Inc.
2        2    182    NaN  Turbo-fan      US           US Airways Inc.
3        2    182    NaN  Turbo-fan      US           US Airways Inc.
4        2     55    NaN  Turbo-fan      EV  ExpressJet Airlines Inc.

##### Here for pandas implementation, first I have filtered distinct records from carrier and tailnum columns from flights data and stored in cartail dataframe and then it is merged with airlines dataframe on carrier column. Now planes dataframe is also merged with this data to get the final outcome as asked in the question.

In [26]:
pd.testing.assert_frame_equal(task16_sql, task16_my)

### 2 Additional Tasks for Postgraduate (SIT731) Students (*)

##### Query 17

In [27]:
task17_sql = pd.read_sql_query("""
    SELECT
      flights2.*,
      atemp,
      ahumid
    FROM (
        SELECT * FROM flights WHERE origin='EWR'
    ) AS flights2
    LEFT JOIN (
          SELECT
            year, month, day,
            AVG(temp) AS atemp,
            AVG(humid) AS ahumid
          FROM Weather
          WHERE origin='EWR'
          GROUP BY year, month, day
    ) AS weather2
    ON flights2.year=weather2.year
    AND flights2.month=weather2.month
    AND flights2.day=weather2.day
""", conn)

In [28]:
#Pandas

flights2 = nyc_flights_df.query('origin=="EWR"').reset_index(drop=True)
weather2 = nyc_weather_df.query('origin=="EWR"').reset_index(drop=True)
weather2.head()

,origin,year,month,day,hour,temp,dewp,humid,wind_dir,wind_speed,wind_gust,precip,pressure,visib,time_hour
0,EWR,2013,1,1,0,37.04,21.92,53.97,230.0,10.35702,11.918651,0.0,1013.9,10.0,01/01/13 1:00
1,EWR,2013,1,1,1,37.04,21.92,53.97,230.0,13.80936,15.891535,0.0,1013.0,10.0,01/01/13 2:00
2,EWR,2013,1,1,2,37.94,21.92,52.09,230.0,12.65858,14.567241,0.0,1012.6,10.0,01/01/13 3:00
3,EWR,2013,1,1,3,37.94,23.00,54.51,230.0,13.80936,15.891535,0.0,1012.7,10.0,01/01/13 4:00
4,EWR,2013,1,1,4,37.94,24.08,57.04,240.0,14.96014,17.215830,0.0,1012.8,10.0,01/01/13 5:00

In [29]:
weather2 = (weather2.groupby(['year', 'month', 'day'])['temp', 'humid'].mean().
            reset_index())
weather2.rename(columns={'temp':'atemp', 'humid':'ahumid'}, inplace=True)

In [30]:
task17_my = pd.merge(flights2, weather2, on = ['year', 'month', 'day'], how='left')
task17_my.head()

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,...,tailnum,origin,dest,air_time,distance,hour,minute,time_hour,atemp,ahumid
0,2013,1,1,517.0,515,2.0,830.0,819,11.0,UA,...,N14228,EWR,IAH,227.0,1400,5,15,01/01/13 5:00,38.48,58.386087
1,2013,1,1,554.0,558,-4.0,740.0,728,12.0,UA,...,N39463,EWR,ORD,150.0,719,5,58,01/01/13 5:00,38.48,58.386087
2,2013,1,1,555.0,600,-5.0,913.0,854,19.0,B6,...,N516JB,EWR,FLL,158.0,1065,6,0,01/01/13 6:00,38.48,58.386087
3,2013,1,1,558.0,600,-2.0,923.0,937,-14.0,UA,...,N53441,EWR,SFO,361.0,2565,6,0,01/01/13 6:00,38.48,58.386087
4,2013,1,1,559.0,600,-1.0,854.0,902,-8.0,UA,...,N76515,EWR,LAS,337.0,2227,6,0,01/01/13 6:00,38.48,58.386087

In [31]:
#Result print
print('Result from SQL Query:')
print(task17_sql.head(5))
print('\nResult from Pandas:')
print(task17_my.head(5))

Result from SQL Query:
   year  month  day  dep_time  sched_dep_time  dep_delay  arr_time  \
0  2013      1    1     517.0             515        2.0     830.0
1  2013      1    1     554.0             558       -4.0     740.0
2  2013      1    1     555.0             600       -5.0     913.0
3  2013      1    1     558.0             600       -2.0     923.0
4  2013      1    1     559.0             600       -1.0     854.0

   sched_arr_time  arr_delay carrier  ...  tailnum origin dest air_time  \
0             819       11.0      UA  ...   N14228    EWR  IAH    227.0
1             728       12.0      UA  ...   N39463    EWR  ORD    150.0
2             854       19.0      B6  ...   N516JB    EWR  FLL    158.0
3             937      -14.0      UA  ...   N53441    EWR  SFO    361.0
4             902       -8.0      UA  ...   N76515    EWR  LAS    337.0

   distance  hour  minute      time_hour  atemp     ahumid
0      1400     5      15  01/01/13 5:00  38.48  58.386087
1       719     5      58  01/01/13 5:00  38.48  58.386087
2      1065     6       0  01/01/13 6:00  38.48  58.386087
3      2565     6       0  01/01/13 6:00  38.48  58.386087
4      2227     6       0  01/01/13 6:00  38.48  58.386087

[5 rows x 21 columns]

Result from Pandas:
   year  month  day  dep_time  sched_dep_time  dep_delay  arr_time  \
0  2013      1    1     517.0             515        2.0     830.0
1  2013      1    1     554.0             558       -4.0     740.0
2  2013      1    1     555.0             600       -5.0     913.0
3  2013      1    1     558.0             600       -2.0     923.0
4  2013      1    1     559.0             600       -1.0     854.0

   sched_arr_time  arr_delay carrier  ...  tailnum origin dest air_time  \
0             819       11.0      UA  ...   N14228    EWR  IAH    227.0
1             728       12.0      UA  ...   N39463    EWR  ORD    150.0
2             854       19.0      B6  ...   N516JB    EWR  FLL    158.0
3             937      -14.0      UA  ...   N53441    EWR  SFO    361.0
4             902       -8.0      UA  ...   N76515    EWR  LAS    337.0

   distance  hour  minute      time_hour  atemp     ahumid
0      1400     5      15  01/01/13 5:00  38.48  58.386087
1       719     5      58  01/01/13 5:00  38.48  58.386087
2      1065     6       0  01/01/13 6:00  38.48  58.386087
3      2565     6       0  01/01/13 6:00  38.48  58.386087
4      2227     6       0  01/01/13 6:00  38.48  58.386087

[5 rows x 21 columns]

In [32]:
pd.testing.assert_frame_equal(task17_sql, task17_my)

In [33]:
task17_my['atemp'] = task17_my['atemp'].astype('float')
pd.testing.assert_frame_equal(task17_sql, task17_my)

##### Here for pandas implementation, firstly I have created two seperate data i.e. flights2 and weather2. Both flights2 and weather2 is the filtered records from flights data with origin EWR. Weather2 is then aggregated by groupby on year, month and day columns and aggregate function is mean. These 2 dataframes is then merged to create the final outcome. Later on by using testing.assert_frame_equal it was found that the dataframe obtained from sql query and pandas is not exactly same so the required changes were made like changing the datatype of atemp and then it was checked again which later on confirmed that two dataframes are now same. testing.assert_frame_equal is used to match two dataframes if they are same or not.

### Conclusion : This task was to replicate all the sql queries with pandas functions. I have explained all the queries and how it was solved with pandas functions. This task helped me to get deeper hands on training by working with dataframes.